Belt_Songs/app/controllers/listener_controller.rb

INSERT INTO "listeners" ("user_id", "song_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["song_id", 3], ["created_at", "2018-08-17 16:55:17.517014"], ["updated_at", "2018-08-17 16:55:17.517014"]]
---
    def create
        Listener.create(user_id: params[:user_id], song_id: params[:song_id])