Belt_Songs/app/controllers/songs_controller.rb

  def index
      @songs = Song.all
      @user = User.find(session[:user_id])
---
SELECT "songs".* FROM "songs"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @user = User.find(session[:user_id])
    new_song = Song.create(song_params.merge(user_id: @user.id))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "songs" ("artist", "title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["artist", "Michael Jackson"], ["title", "Thriller"], ["user_id", 1], ["created_at", "2018-08-17 16:01:11.796308"], ["updated_at", "2018-08-17 16:01:11.796308"]]

 def show
    @user = User.find(session[:user_id])
    @song = Song.find(id = params[:id])
    @listeners = Listener.where("song_id = '#{params[:id]}'")
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "listeners".* FROM "listeners" WHERE (song_id = '4')