Belt_Songs/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "listeners".* FROM "listeners" WHERE "listeners"."user_id" = 3
---
  def show
    @user = User.find(params[:id])
    @songs = Listener.where(user:@user)

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    userparams = params.require(:user).permit(:first_name, :last_name, :email, :password, :password_confirmation)
    user = User.new(userparams)
    if user.valid?
        user.save